In [13]:
import pandas as pd
import numpy as np

print(pd.__version__)

1.0.4

In [25]:
seri = pd.Series([1, 20, 3, -12, 5], index=['a', 'b', 'c', 'd', 'e'])
#seri = pd.Series([1, 20, 3, -12, 5])
seri[0]

1

In [24]:
seri

a     1
b    20
c     3
d   -12
e     5
dtype: int64

In [5]:
data = {
    'İsim': ['Özge', 'Ahmet', 'Şirin', 'Mehmet'],
    'Tecrübe(yr)' : [3, 8.5, 2.5, 1],
    'Maas' : [9000, 2500, 6500, 5000]
}

df = pd.DataFrame(data, columns = ["İsim", "Tecrübe(yr)", "Maas"])
df

     İsim  Tecrübe(yr)  Maas
0    Özge          3.0  9000
1   Ahmet          8.5  2500
2   Şirin          2.5  6500
3  Mehmet          1.0  5000

In [26]:
df.İsim = df.İsim.astype('string') #İsim sütununun Tipini string olarak güncelliyoruz.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   İsim         4 non-null      string
 1   Tecrübe(yr)  4 non-null      float64
 2   Maas         4 non-null      int64
dtypes: float64(1), int64(1), string(1)
memory usage: 224.0 bytes

# Titanic Dataset

* Survival = Kişi yaşıyor/yaşamıyor (0 yada 1)
* pclass = Bilet sınıfı (1st, 2st, 3st)
* sex = cinsiyet
* age = yaş
* sibsp = kaç kardeşi yada eşi olduğu
* parch = kaç ebeveyni yada çocuğu olduğu 
* ticket = bilet numarası
* fare = ücret
* cabin = kaçıncı kabinde olduğu
* embarked = hangi limandan titaniğe bindiği

In [63]:
df = pd.read_csv('/content/sample_data/train.csv')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [31]:
df.shape # Bu dataframemimizin şeklini görmüş oluyoruz 891 satır 12 sütun
#891 yolcu 12 ayrı özellik

(891, 12)

In [32]:
#m, n = df.shape
#m * n
df.size #kaçtane cell olduğunu veriyor

10692

In [33]:
df.ndim #df nin kaç boyutlu olduğunu söylüyor

2

In [34]:
df.columns#columnların ismini bize verecek.

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [38]:
df.head() #göz atma en yukarıdan 5 satır

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [39]:
df.head(7) #verdiğimiz sayı kadar üstten gösterecek.

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S

[7 rows x 12 columns]

In [41]:
df.tail(8)#içine verdiimiz sayı kadar aşağıdan yukarı sayı verecek

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
883          884         0       2  ...  10.500   NaN         S
884          885         0       3  ...   7.050   NaN         S
885          886         0       3  ...  29.125   NaN         Q
886          887         0       2  ...  13.000   NaN         S
887          888         1       1  ...  30.000   B42         S
888          889         0       3  ...  23.450   NaN         S
889          890         1       1  ...  30.000  C148         C
890          891         0       3  ...   7.750   NaN         Q

[8 rows x 12 columns]

In [42]:
df.dtypes #bütün sütunların tiplerini öğreneceğiz

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [43]:
df.corr() #Örn : Kurtulma şansımız %25 paraya bağlı (Fare - Survived Korelasyon)

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.036847 -0.077221 -0.369226  ... -0.308247 -0.189119  0.096067
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [44]:
#Null (NaN) olmayan veri sayısı
#NaN denilen değer, not in number, sayı değil, yani boş bir değer.
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [45]:
df["Embarked"] # Hangi limanda titaniğe bindiğini listeliyorum.
#Direk sütuna ulaşabiliyoruz
#veya df.Embarked

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [47]:
df['Yeni Sütun'] = 'Yeni' # yeni sütun ekleme
df

     PassengerId  Survived  Pclass  ... Cabin Embarked  Yeni Sütun
0              1         0       3  ...   NaN        S        Yeni
1              2         1       1  ...   C85        C        Yeni
2              3         1       3  ...   NaN        S        Yeni
3              4         1       1  ...  C123        S        Yeni
4              5         0       3  ...   NaN        S        Yeni
..           ...       ...     ...  ...   ...      ...         ...
886          887         0       2  ...   NaN        S        Yeni
887          888         1       1  ...   B42        S        Yeni
888          889         0       3  ...   NaN        S        Yeni
889          890         1       1  ...  C148        C        Yeni
890          891         0       3  ...   NaN        Q        Yeni

[891 rows x 13 columns]

In [49]:
df.iloc[0,0] #dataframe.indexlocation[0,0] = [satır, sütun]
#0.satır / 0.sütun ile kesişen değeri ver.

0

In [66]:
df.loc[3, ['Age', 'Sex']]

Age        35
Sex    female
Name: 3, dtype: object

In [51]:
c  = df.iloc[0:4, 0:4]

In [59]:
c.shape

(4, 4)

In [68]:
indexes = [str(i) for i in range(891)] #one liner for
df.index = indexes
df.index

Index(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
       ...
       '881', '882', '883', '884', '885', '886', '887', '888', '889', '890'],
      dtype='object', length=891)

In [69]:
df.reset_index(inplace = True, drop = True)#Geri alıyorum. inplace True olduğundan tekrar df e eşitlemeyeceğim.
#Diğer indexi silip üzerine eşitliyor(drop)
df.index

RangeIndex(start=0, stop=891, step=1)

In [75]:

print(id(df.drop([0, 3, 2, 5]))) #df in bir kopyasını oluşturuyor.
print(id(df))

140470164409872
140470164717128

In [76]:
df.drop('Cabin', axis = 1) #sütunları düşürmek 'Cabin' sütununu sielceğiz.

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Embarked
0              1         0       3  ...         A/5 21171   7.2500         S
1              2         1       1  ...          PC 17599  71.2833         C
2              3         1       3  ...  STON/O2. 3101282   7.9250         S
3              4         1       1  ...            113803  53.1000         S
4              5         0       3  ...            373450   8.0500         S
..           ...       ...     ...  ...               ...      ...       ...
886          887         0       2  ...            211536  13.0000         S
887          888         1       1  ...            112053  30.0000         S
888          889         0       3  ...        W./C. 6607  23.4500         S
889          890         1       1  ...            111369  30.0000         C
890          891         0       3  ...            370376   7.7500         Q

[891 rows x 11 columns]

In [77]:
a = [1, 2, 3]
b = [1, 2, 3]
c = a

In [78]:
print(f"id(a):", id(a))
print(f"id(b):", id(b))
print(f"id(c):", id(c))

id(a): 140470171228168
id(b): 140470220910728
id(c): 140470171228168

In [82]:
a == b
a is b

False

In [83]:
a == c
a is c

True

In [85]:
df.isnull().sum() #kaçtane boş değer var, isna = isnull arasında fark yok

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [87]:
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. versionchanged:: 1.0.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values.
    subset : array-like, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        If True, do operation inplace and return None.

    Returns
    -------
    DataFrame
        DataFrame with NA entries dropped from it.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'born'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

In [89]:
df.iloc[0:100:3, 3:6:3] = None
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [91]:
df.Cabin.dropna()
#687 tane satırı sildim 204 kaldı.

1              C85
3             C123
6              E46
10              G6
11            C103
          ...
871            D35
872    B51 B53 B55
879            C50
887            B42
889           C148
Name: Cabin, Length: 204, dtype: object

In [92]:
df.dropna(subset=["Cabin", "Age"], how = "all").count()

PassengerId    733
Survived       733
Pclass         733
Name           704
Sex            733
Age            714
SibSp          733
Parch          733
Ticket         733
Fare           733
Cabin          204
Embarked       731
dtype: int64

In [97]:
df.dropna(thresh = 204, axis = 1).count()

PassengerId    891
Survived       891
Pclass         891
Name           857
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [98]:
df['Survived'].sum()

342

In [99]:
df['Age'].max()

80.0

In [100]:
df['Age'].idxmax() #80 yaşındaki kişi 630.satırda

630

In [101]:
df['Age'].min()

0.42

In [102]:
df['Age'].idxmin()

803

In [103]:
df.mean() #Ortalama

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [104]:
df.median()

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [105]:
a = pd.Series([10, 20, 30, 35, 40, 50, 60])
a.describe()
#7 elemanı var
#ortalaması 35
#standart sapması 17.07
#minimum değeri 10
#maksimum değeri 60
#alt medyan 25
#medyan 35
#üst medyan 45

count     7.000000
mean     35.000000
std      17.078251
min      10.000000
25%      25.000000
50%      35.000000
75%      45.000000
max      60.000000
dtype: float64

In [106]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [107]:
df.Age.apply(lambda x : x if x >= 1 else 0)#içerideki parametre 1 den büyükse kendisi değilse 0 olarak dönsün

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [109]:
df.Embarked.unique()
df.Embarked = df.Embarked.apply(lambda x : str(x).replace('Q', 'Z'))
df.Embarked.unique()

array(['S', 'C', 'Z', 'nan'], dtype=object)

In [110]:
df.Age.sort_values(0) #yaşları sıraladım.

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: Age, Length: 891, dtype: float64

In [114]:
df['Fare'] > df.Fare.mean()

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Fare, Length: 891, dtype: bool

In [118]:
a = df[df['Fare'] > df.Fare.mean()] 
a.head() #Verilen ücret ortalama ücretten yüksek olanları getiriyoruz.

    PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
1             2         1       1  ...   71.2833          C85         C
3             4         1       1  ...   53.1000         C123         S
6             7         0       1  ...   51.8625          E46         S
23           24         1       1  ...   35.5000           A6         S
27           28         0       1  ...  263.0000  C23 C25 C27         S

[5 rows x 12 columns]

In [120]:
print('Ortalama : ',df.Fare.mean())

Ortalama :  32.2042079685746

In [121]:
grup = df.groupby('Embarked')
grup.mean()

          PassengerId  Survived    Pclass  ...     SibSp     Parch       Fare
Embarked                                   ...
C          445.357143  0.553571  1.886905  ...  0.386905  0.363095  59.954144
S          449.527950  0.336957  2.350932  ...  0.571429  0.413043  27.079812
Z          417.896104  0.389610  2.909091  ...  0.428571  0.168831  13.276030
nan        446.000000  1.000000  1.000000  ...  0.000000  0.000000  80.000000

[4 rows x 7 columns]

In [122]:


grup.Age.agg(np.mean)
#grup.mean().Age
grup.agg([np.size, np.sum, np.mean])

         PassengerId                      ...   Fare
                size     sum        mean  ...   size         sum       mean
Embarked                                  ...
C                168   74820  445.357143  ...  168.0  10072.2962  59.954144
S                644  289496  449.527950  ...  644.0  17439.3988  27.079812
Z                 77   32178  417.896104  ...   77.0   1022.2543  13.276030
nan                2     892  446.000000  ...    2.0    160.0000  80.000000

[4 rows x 21 columns]

In [123]:
for isim, icerik in grup:
  print("=>", isim)
  print(icerik.Age)
  print("-"*40)

=> C
1      38.0
9      14.0
19      NaN
26      NaN
30     40.0
       ...
866    27.0
874    28.0
875    15.0
879    56.0
889    26.0
Name: Age, Length: 168, dtype: float64
----------------------------------------
=> S
0      22.0
2      26.0
3      35.0
4      35.0
6      54.0
       ...
883    28.0
884    25.0
886    27.0
887    19.0
888     NaN
Name: Age, Length: 644, dtype: float64
----------------------------------------
=> Z
5       NaN
16      2.0
22     15.0
28      NaN
32      NaN
       ...
790     NaN
825     NaN
828     NaN
885    39.0
890    32.0
Name: Age, Length: 77, dtype: float64
----------------------------------------
=> nan
61     38.0
829    62.0
Name: Age, dtype: float64
----------------------------------------

In [127]:
grup.agg([np.size, np.sum , np.mean])

         PassengerId                      ...   Fare
                size     sum        mean  ...   size         sum       mean
Embarked                                  ...
C                168   74820  445.357143  ...  168.0  10072.2962  59.954144
S                644  289496  449.527950  ...  644.0  17439.3988  27.079812
Z                 77   32178  417.896104  ...   77.0   1022.2543  13.276030
nan                2     892  446.000000  ...    2.0    160.0000  80.000000

[4 rows x 21 columns]

In [128]:
grup.get_group('S').shape

(644, 12)

In [129]:
grup.filter(lambda x: x['Fare'].mean() > 30)#x in fare sütunun ortalamasının 30 dan büyük olanları ver

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
9             10         1       2  ...  30.0708   NaN         C
19            20         1       3  ...   7.2250   NaN         C
26            27         0       3  ...   7.2250   NaN         C
30            31         0       1  ...  27.7208   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
866          867         1       2  ...  13.8583   NaN         C
874          875         1       2  ...  24.0000   NaN         C
875          876         1       3  ...   7.2250   NaN         C
879          880         1       1  ...  83.1583   C50         C
889          890         1       1  ...  30.0000  C148         C

[170 rows x 12 columns]